# -*- coding: utf8 -*-
"""
Модуль запускает всю программу.
Продинутый вариант первого скрипта.
"""

from pakTank.modOperaTank import clsOperaTank

if True: # ведёт статистику по боям
    # статистика моего танка
    stat_my_tank = [ 312, 282, 291, 328]
    
    # статистика противников
    stat_tank1 = [0, 0, 0, 0]
    stat_tank2 = [0, 0, 0, 0]
    
    # статистика побед над мощностями
    stat_win_mosh = [517, 530, 528, 532, 522, 516, 532, 539, 518, 535]
    # статистика побед над вероятностями
    stat_win_ver =  [115, 114, 113, 112, 113, 115, 113, 112, 117, 113]

    # статистика проигрышей над мощностями
    stat_los_mosh = [535, 524, 520]
    # статистика проигрышей над вероятностями
    stat_los_ver = [113, 113, 114]

from Tkinter import Frame

def main():
    """
    Главный запускающий скрипт.
    """
    app = clsOperaTank()
    app.run()

if __name__ == '__main__':
    main()
