# -*- coding: utf8 -*-
'''
модуль определяет БИОС виртуальной машины.

    A.rset(A)=0     A.radd(A)=1     A.rsub(A)=2     A.rinc()=3
    A.rdec()=4      A.rnot(A)=5     A.rxor(A)=6     A.ror(A)=7
    A_rand=8        A_rshr=9        A_rshl=10       A.nset(n)=11
    A.nadd(n)=12    A_nsub=13       A_nnot=14       A_nxor=15
    A.nor =16       A_nand=17       A_mget=18       A_madd=19
    A.msub=20       A_minc=21       A_mdec=22       A_mnot=23
    A_mxor=24       A_mor =25       A_mand=26       A_mshr=27
    A_mshl=28       A_getf =29      A_setf =30      A_ifz =31
    A_ncmp=32       A_ifnz=33       A_mset=34       A_push=35
    A_pop =36       A_call=37       A_ret =38       A.in(p)=39
    A.out(p)=40     A_vin =41       A.jmp(m)=42
    
При старте системы происходит обход начальных процедур путём прыжка за них.

'''

bios={
    0:0, # 
    1:0, # 
    2:0, # 
    3:0,  # 
    4:0, # 
    5:0,  # 
    6:0, # 
    7:0,  # 
    8:0,  # 
    9:0, # 
    10:0, # 
    11:0, # 
    12:0, #
    13:0, #
    14:0, #
    15:0, #
    16:0, #
    17:0, #
    18:0, #
    19:0, #
    20:0, #
    21:0, #
    22:0, #
    23:0, #
    24:0, #
    25:0, #
    26:0, #
    27:0, #
    28:0, #
    29:0, #
    30:0, #
    31:0, #
    32:0, #
    33:0, #
    34:0, #
    35:0, #
    36:0, #
    37:0, #
    38:0, #
    39:0, #
    40:0, #
    
}
